#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.alz.random_id.telem[0]: Refreshing state... [id=a-P24A]
data.azurerm_client_config.current: Reading...
module.alz.azurerm_subscription_template_deployment.telemetry_core[0]: Refreshing state... [id=/subscriptions/d6e967f0-227a-4bd3-ac94-6756273270cc/providers/Microsoft.Resources/deployments/pid-36dcde81-8c33-4da0-8dc3-265381502ccb_v4.2.0_0000_6be3f6e0]
module.alz.azurerm_resource_group.connectivity["/subscriptions/d6e967f0-227a-4bd3-ac94-6756273270cc/resourceGroups/core-platform-connectivity-northeurope"]: Refreshing state... [id=/subscriptions/d6e967f0-227a-4bd3-ac94-6756273270cc/resourceGroups/core-platform-connectivity-northeurope]
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0zYTkzNmE0NS1mYTVlLTQ3MTctODRmYS00NzMyZjNkODVjMmM7b2JqZWN0SWQ9ZmU2YTYzZmMtMTZiNS00ZWY4LWFjYTAtZjJjYjU0YjExYWY3O3N1YnNjcmlwdGlvbklkPWQ2ZTk2N2YwLTIyN2EtNGJkMy1hYzk0LTY3NTYyNzMyNzBjYzt0ZW5hbnRJZD1lMDYxZjhiNy1jYWYzLTQ1ZjItYThiYy00OTFjZWE5ZTY0YWE=]
module.alz.azurerm_resource_group.connectivity["/subscriptions/d6e967f0-227a-4bd3-ac94-6756273270cc/resourceGroups/core-platform-connectivity-westeurope"]: Refreshing state... [id=/subscriptions/d6e967f0-227a-4bd3-ac94-6756273270cc/resourceGroups/core-platform-connectivity-westeurope]
module.alz.time_sleep.after_azurerm_management_group: Refreshing state... [id=2024-11-07T10:27:22Z]
module.alz.time_sleep.after_azurerm_policy_definition: Refreshing state... [id=2024-11-07T10:27:52Z]
module.alz.azurerm_subscription_template_deployment.telemetry_connectivity[0]: Refreshing state... [id=/subscriptions/d6e967f0-227a-4bd3-ac94-6756273270cc/providers/Microsoft.Resources/deployments/pid-97603aac-98f8-4a55-92fc-4c78378c9ba5_v4.2.0_0001_6be3f6e0]
module.alz.time_sleep.after_azurerm_role_definition: Refreshing state... [id=2024-11-07T10:28:22Z]
module.alz.azurerm_public_ip.connectivity["/subscriptions/d6e967f0-227a-4bd3-ac94-6756273270cc/resourceGroups/core-platform-connectivity-westeurope/providers/Microsoft.Network/publicIPAddresses/core-platform-vpngw-westeurope-pip"]: Refreshing state... [id=/subscriptions/d6e967f0-227a-4bd3-ac94-6756273270cc/resourceGroups/core-platform-connectivity-westeurope/providers/Microsoft.Network/publicIPAddresses/core-platform-vpngw-westeurope-pip]
module.alz.azurerm_virtual_network.connectivity["/subscriptions/d6e967f0-227a-4bd3-ac94-6756273270cc/resourceGroups/core-platform-connectivity-westeurope/providers/Microsoft.Network/virtualNetworks/core-platform-hub-westeurope"]: Refreshing state... [id=/subscriptions/d6e967f0-227a-4bd3-ac94-6756273270cc/resourceGroups/core-platform-connectivity-westeurope/providers/Microsoft.Network/virtualNetworks/core-platform-hub-westeurope]
module.alz.azurerm_virtual_network.connectivity["/subscriptions/d6e967f0-227a-4bd3-ac94-6756273270cc/resourceGroups/core-platform-connectivity-northeurope/providers/Microsoft.Network/virtualNetworks/core-platform-hub-northeurope"]: Refreshing state... [id=/subscriptions/d6e967f0-227a-4bd3-ac94-6756273270cc/resourceGroups/core-platform-connectivity-northeurope/providers/Microsoft.Network/virtualNetworks/core-platform-hub-northeurope]
module.alz.time_sleep.after_azurerm_policy_set_definition: Refreshing state... [id=2024-11-07T10:28:23Z]
module.alz.time_sleep.after_azurerm_policy_assignment: Refreshing state... [id=2024-11-07T10:28:53Z]
module.alz.time_sleep.after_azurerm_role_assignment: Refreshing state... [id=2024-11-07T10:28:53Z]
module.alz.azurerm_subnet.connectivity["/subscriptions/d6e967f0-227a-4bd3-ac94-6756273270cc/resourceGroups/core-platform-connectivity-westeurope/providers/Microsoft.Network/virtualNetworks/core-platform-hub-westeurope/subnets/GatewaySubnet"]: Refreshing state... [id=/subscriptions/d6e967f0-227a-4bd3-ac94-6756273270cc/resourceGroups/core-platform-connectivity-westeurope/providers/Microsoft.Network/virtualNetworks/core-platform-hub-westeurope/subnets/GatewaySubnet]
module.alz.azurerm_subnet.connectivity["/subscriptions/d6e967f0-227a-4bd3-ac94-6756273270cc/resourceGroups/core-platform-connectivity-northeurope/providers/Microsoft.Network/virtualNetworks/core-platform-hub-northeurope/subnets/GatewaySubnet"]: Refreshing state... [id=/subscriptions/d6e967f0-227a-4bd3-ac94-6756273270cc/resourceGroups/core-platform-connectivity-northeurope/providers/Microsoft.Network/virtualNetworks/core-platform-hub-northeurope/subnets/GatewaySubnet]
module.alz.azurerm_virtual_network_gateway.connectivity["/subscriptions/d6e967f0-227a-4bd3-ac94-6756273270cc/resourceGroups/core-platform-connectivity-westeurope/providers/Microsoft.Network/virtualNetworkGateways/core-platform-vpngw-westeurope"]: Refreshing state... [id=/subscriptions/d6e967f0-227a-4bd3-ac94-6756273270cc/resourceGroups/core-platform-connectivity-westeurope/providers/Microsoft.Network/virtualNetworkGateways/core-platform-vpngw-westeurope]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.alz.azurerm_firewall.connectivity["/subscriptions/d6e967f0-227a-4bd3-ac94-6756273270cc/resourceGroups/core-platform-connectivity-westeurope/providers/Microsoft.Network/azureFirewalls/core-platform-fw-westeurope"] will be created
  + resource "azurerm_firewall" "connectivity" {
      + dns_proxy_enabled   = (known after apply)
      + firewall_policy_id  = "/subscriptions/d6e967f0-227a-4bd3-ac94-6756273270cc/resourceGroups/core-platform-connectivity-westeurope/providers/Microsoft.Network/firewallPolicies/core-platform-fw-westeurope-policy"
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "core-platform-fw-westeurope"
      + resource_group_name = "core-platform-connectivity-westeurope"
      + sku_name            = "AZFW_VNet"
      + sku_tier            = "Standard"
      + tags                = {
          + "demo_type"  = "deploy_connectivity_resources_custom"
          + "deployedBy" = "core_platform_connectivity"
        }
      + threat_intel_mode   = "Alert"
      + zones               = [
          + "1",
          + "2",
          + "3",
        ]

      + ip_configuration {
          + name                 = "core-platform-fw-westeurope-pip"
          + private_ip_address   = (known after apply)
          + public_ip_address_id = "/subscriptions/d6e967f0-227a-4bd3-ac94-6756273270cc/resourceGroups/core-platform-connectivity-westeurope/providers/Microsoft.Network/publicIPAddresses/core-platform-fw-westeurope-pip"
          + subnet_id            = "/subscriptions/d6e967f0-227a-4bd3-ac94-6756273270cc/resourceGroups/core-platform-connectivity-westeurope/providers/Microsoft.Network/virtualNetworks/core-platform-hub-westeurope/subnets/AzureFirewallSubnet"
        }
    }

  # module.alz.azurerm_firewall_policy.connectivity["/subscriptions/d6e967f0-227a-4bd3-ac94-6756273270cc/resourceGroups/core-platform-connectivity-westeurope/providers/Microsoft.Network/firewallPolicies/core-platform-fw-westeurope-policy"] will be created
  + resource "azurerm_firewall_policy" "connectivity" {
      + child_policies           = (known after apply)
      + firewalls                = (known after apply)
      + id                       = (known after apply)
      + location                 = "westeurope"
      + name                     = "core-platform-fw-westeurope-policy"
      + resource_group_name      = "core-platform-connectivity-westeurope"
      + rule_collection_groups   = (known after apply)
      + sku                      = "Standard"
      + tags                     = {
          + "demo_type"  = "deploy_connectivity_resources_custom"
          + "deployedBy" = "core_platform_connectivity"
        }
      + threat_intelligence_mode = "Alert"

      + dns {
          + proxy_enabled = true
        }
    }

  # module.alz.azurerm_public_ip.connectivity["/subscriptions/d6e967f0-227a-4bd3-ac94-6756273270cc/resourceGroups/core-platform-connectivity-westeurope/providers/Microsoft.Network/publicIPAddresses/core-platform-fw-westeurope-pip"] will be created
  + resource "azurerm_public_ip" "connectivity" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "westeurope"
      + name                    = "core-platform-fw-westeurope-pip"
      + resource_group_name     = "core-platform-connectivity-westeurope"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
      + tags                    = {
          + "demo_type"  = "deploy_connectivity_resources_custom"
          + "deployedBy" = "core_platform_connectivity"
        }
      + zones                   = [
          + "1",
          + "2",
          + "3",
        ]
    }

  # module.alz.azurerm_subnet.connectivity["/subscriptions/d6e967f0-227a-4bd3-ac94-6756273270cc/resourceGroups/core-platform-connectivity-westeurope/providers/Microsoft.Network/virtualNetworks/core-platform-hub-westeurope/subnets/AzureFirewallSubnet"] will be created
  + resource "azurerm_subnet" "connectivity" {
      + address_prefixes                               = [
          + "10.100.0.0/24",
        ]
      + default_outbound_access_enabled                = true
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "AzureFirewallSubnet"
      + private_endpoint_network_policies              = (known after apply)
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "core-platform-connectivity-westeurope"
      + virtual_network_name                           = "core-platform-hub-westeurope"
    }

  # module.alz.azurerm_subscription_template_deployment.telemetry_connectivity[0] must be replaced
-/+ resource "azurerm_subscription_template_deployment" "telemetry_connectivity" {
      ~ id                 = "/subscriptions/d6e967f0-227a-4bd3-ac94-6756273270cc/providers/Microsoft.Resources/deployments/pid-97603aac-98f8-4a55-92fc-4c78378c9ba5_v4.2.0_0001_6be3f6e0" -> (known after apply)
      ~ name               = "pid-97603aac-98f8-4a55-92fc-4c78378c9ba5_v4.2.0_0001_6be3f6e0" -> "pid-97603aac-98f8-4a55-92fc-4c78378c9ba5_v6.0.0_0001_6be3f6e0" # forces replacement
      ~ output_content     = jsonencode(
            {
              - telemetry = {
                  - type  = "String"
                  - value = "For more information, see https://aka.ms/alz/tf/telemetry"
                }
            }
        ) -> (known after apply)
      ~ parameters_content = jsonencode({}) -> (known after apply)
      - tags               = {} -> null
        # (2 unchanged attributes hidden)
    }

  # module.alz.azurerm_subscription_template_deployment.telemetry_core[0] must be replaced
-/+ resource "azurerm_subscription_template_deployment" "telemetry_core" {
      ~ id                 = "/subscriptions/d6e967f0-227a-4bd3-ac94-6756273270cc/providers/Microsoft.Resources/deployments/pid-36dcde81-8c33-4da0-8dc3-265381502ccb_v4.2.0_0000_6be3f6e0" -> (known after apply)
      ~ name               = "pid-36dcde81-8c33-4da0-8dc3-265381502ccb_v4.2.0_0000_6be3f6e0" -> "pid-36dcde81-8c33-4da0-8dc3-265381502ccb_v6.0.0_0000_6be3f6e0" # forces replacement
      ~ output_content     = jsonencode(
            {
              - telemetry = {
                  - type  = "String"
                  - value = "For more information, see https://aka.ms/alz/tf/telemetry"
                }
            }
        ) -> (known after apply)
      ~ parameters_content = jsonencode({}) -> (known after apply)
      - tags               = {} -> null
        # (2 unchanged attributes hidden)
    }

Plan: 6 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ configuration   = {
      ~ settings = {
          ~ hub_networks         = [
              ~ {
                  ~ config  = {
                      + azure_firewall                          = {
                          + config  = {
                              + address_prefix                = "10.100.0.0/24"
                              + availability_zones            = {
                                  + zone_1 = true
                                  + zone_2 = true
                                  + zone_3 = true
                                }
                              + base_policy_id                = ""
                              + dns_servers                   = []
                              + enable_dns_proxy              = true
                              + private_ip_ranges             = []
                              + sku_tier                      = ""
                              + threat_intelligence_allowlist = {}
                              + threat_intelligence_mode      = ""
                            }
                          + enabled = true
                        }
                        # (9 unchanged attributes hidden)
                    }
                    # (1 unchanged attribute hidden)
                },
                {
                    config  = {
                        address_space                           = [
                            "10.101.0.0/16",
                        ]
                        bgp_community                           = ""
                        enable_hub_network_mesh_peering         = false
                        enable_outbound_virtual_network_peering = true
                        link_to_ddos_protection_plan            = false
                        location                                = "northeurope"
                        spoke_virtual_network_resource_ids      = []
                        subnets                                 = []
                        virtual_network_gateway                 = {
                            config  = {
                                address_prefix        = "10.101.1.0/24"
                                advanced_vpn_settings = {
                                    active_active                    = null
                                    bgp_settings                     = []
                                    custom_route                     = []
                                    default_local_network_gateway_id = ""
                                    enable_bgp                       = null
                                    private_ip_address_allocation    = ""
                                    vpn_client_configuration         = []
                                }
                                gateway_sku_vpn       = ""
                            }
                            enabled = true
                        }
                    }
                    enabled = true
                },
            ]
            # (3 unchanged attributes hidden)
        }
        tags     = {
            demo_type  = "deploy_connectivity_resources_custom"
            deployedBy = "core_platform_connectivity"
        }
        # (2 unchanged attributes hidden)
    }

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>